In [1]:
import numpy as np
import pandas as pd

In [2]:
olympic_series_participation = pd.Series([205, 204, 201, 200, 197], index=[2012, 2008, 2004, 2000, 1996])
olympic_series_country = pd.Series(['London','Beijing','Athens','Sydney','Atlanta'], index=[2012, 2008, 2004, 2000, 1996])

In [3]:
df_olympic_series = pd.DataFrame({'No. of Participating Countries':olympic_series_participation, 'Host Cities': olympic_series_country})
df_olympic_series

      No. of Participating Countries Host Cities
2012                             205      London
2008                             204     Beijing
2004                             201      Athens
2000                             200      Sydney
1996                             197     Atlanta

In [4]:
df_olympic_series.describe

<bound method NDFrame.describe of       No. of Participating Countries Host Cities
2012                             205      London
2008                             204     Beijing
2004                             201      Athens
2000                             200      Sydney
1996                             197     Atlanta>

In [5]:
df_olympic_series.head(3)

      No. of Participating Countries Host Cities
2012                             205      London
2008                             204     Beijing
2004                             201      Athens

In [6]:
df_olympic_series.tail(3)

      No. of Participating Countries Host Cities
2004                             201      Athens
2000                             200      Sydney
1996                             197     Atlanta

In [7]:
df_olympic_series.index

Int64Index([2012, 2008, 2004, 2000, 1996], dtype='int64')

In [8]:
df_olympic_series.columns

Index(['No. of Participating Countries', 'Host Cities'], dtype='object')

In [9]:
df_olympic_series['Host Cities']

2012     London
2008    Beijing
2004     Athens
2000     Sydney
1996    Atlanta
Name: Host Cities, dtype: object

In [10]:
df_olympic_series.loc[2012]

No. of Participating Countries       205
Host Cities                       London
Name: 2012, dtype: object

In [11]:
df_olympic_series.iloc[0:2]

      No. of Participating Countries Host Cities
2012                             205      London
2008                             204     Beijing

In [12]:
# Integer-Location based Data Selection by Index Value
df_olympic_series.iat[3,1]

'Sydney'

In [13]:
df_olympic_series[df_olympic_series['No. of Participating Countries']>200]

      No. of Participating Countries Host Cities
2012                             205      London
2008                             204     Beijing
2004                             201      Athens

### Handling Missing Values

In [14]:
first_series = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
second_series = pd.Series([10,20,30,40,50], index=['c','e','f','g','h'])

In [15]:
sum_of_series = first_series + second_series

In [16]:
sum_of_series

a     NaN
b     NaN
c    13.0
d     NaN
e    25.0
f     NaN
g     NaN
h     NaN
dtype: float64

In [17]:
sum_of_series.dropna()

c    13.0
e    25.0
dtype: float64

In [18]:
fill_na_s = sum_of_series.fillna(0)
fill_na_s

a     0.0
b     0.0
c    13.0
d     0.0
e    25.0
f     0.0
g     0.0
h     0.0
dtype: float64

In [19]:
first_series.add(second_series, fill_value=0)

a     1.0
b     2.0
c    13.0
d     4.0
e    25.0
f    30.0
g    40.0
h    50.0
dtype: float64

In [20]:
df_movie_rating = pd.DataFrame({
    'movie 1': [5,4,3,3,2,1],
    'movie 2': [4,5,2,3,4,2]},
    index = ['Tom', 'Jeff', 'Peter', 'Ram', 'Ted', 'Paul']
)

In [21]:
df_movie_rating

       movie 1  movie 2
Tom          5        4
Jeff         4        5
Peter        3        2
Ram          3        3
Ted          2        4
Paul         1        2

In [22]:
def movie_grade(rating):
    if rating == 5:
        return 'A'
    if rating == 4:
        return 'B'
    if rating == 3:
        return 'C'
    else:
        return 'F'

In [23]:
print(movie_grade(5))

A

In [24]:
# Apply the function to the DataFrame
df_movie_rating.applymap(movie_grade)

      movie 1 movie 2
Tom         A       B
Jeff        B       A
Peter       C       F
Ram         C       C
Ted         F       B
Paul        F       F

In [25]:
# Data Operation Using Groupby
df_president_name = pd.DataFrame({'first':['George', 'Bill', 'Barack', 'Jimmy', 'George'],
                                 'last': ['Bush', 'Clinton', 'Obama', 'Carter', 'Washington']})
df_president_name

    first        last
0  George        Bush
1    Bill     Clinton
2  Barack       Obama
3   Jimmy      Carter
4  George  Washington

In [26]:
grouped = df_president_name.groupby('first')

In [27]:
grp_data = grouped.get_group('George')
grp_data

    first        last
0  George        Bush
4  George  Washington

In [28]:
df_president_name.sort_values('first')

    first        last
2  Barack       Obama
1    Bill     Clinton
0  George        Bush
4  George  Washington
3   Jimmy      Carter

### Data Operation

In [29]:
# Define the student data fram with math data
df_student_math = pd.DataFrame({'student':['Tom', 'Jack', 'Dan', 'Ram', 'Jeff', 'David'],
                               'ID':[10,56,31,85,9,22]
                               })

In [30]:
# Define the student data fram with science data
df_student_science = pd.DataFrame({'student':['Tom', 'Ram', 'David'],
                               'ID':[10,12,22]
                               })

In [31]:
pd.merge(df_student_math, df_student_science)

  student  ID
0     Tom  10
1   David  22

In [32]:
pd.merge(df_student_math, df_student_science, on='student')

  student  ID_x  ID_y
0     Tom    10    10
1     Ram    85    12
2   David    22    22

In [33]:
pd.merge(df_student_math, df_student_science, on='ID', how='left').fillna('X')

  student_x  ID student_y
0       Tom  10       Tom
1      Jack  56         X
2       Dan  31         X
3       Ram  85         X
4      Jeff   9         X
5     David  22     David

In [34]:
# Concatenate DataFrames
pd.concat([df_student_math, df_student_science], ignore_index=True)

  student  ID
0     Tom  10
1    Jack  56
2     Dan  31
3     Ram  85
4    Jeff   9
5   David  22
6     Tom  10
7     Ram  12
8   David  22

In [35]:
# Define New DataFrame with Student Survey Data
df_student_survey_data = pd.DataFrame({'student': ['Tom','Jack','Tom','Ram','Jeff','Jack'],
                                      'ID': [10,56,10,85,9,56]})

In [36]:
# View the DataFrame
df_student_survey_data

  student  ID
0     Tom  10
1    Jack  56
2     Tom  10
3     Ram  85
4    Jeff   9
5    Jack  56

In [37]:
df_student_survey_data.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [38]:
df_student_survey_data.drop_duplicates('student')

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9

In [39]:
df_student_survey_data.drop_duplicates('ID')

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9

In [40]:
df_student_survey_data[3:5]

  student  ID
3     Ram  85
4    Jeff   9

### Pandas SQL Operation

In [41]:
import sqlite3

In [42]:
# Create Table
create_table = """
CREATE TABLE student_score
(Id INTEGER, NAME VARCHAR(20), Math REAL, Science REAL);"""

In [43]:
# Execure the SQL Statement
executeSQL = sqlite3.connect(':memory:')
executeSQL.execute(create_table)
executeSQL.commit()

In [44]:
# Prepare a SQL Query
SQL_Query = executeSQL.execute('SELECT * FROM student_score')

In [45]:
# Fetch the Result From the SQLLITE Database
resultset = SQL_Query.fetchall()

In [46]:
resultset

[]

In [47]:
# Prepare records to be inserted into SQL table through SQL statement
insertSQL = [(10, 'Jack', 85, 92), (29, 'Tom', 73, 89), (65, 'Ram', 65.6, 77), (5, 'Steve', 55, 91)]

In [48]:
insert_statement = "INSERT INTO student_score values (?,?,?,?)"
executeSQL.executemany(insert_statement, insertSQL)
executeSQL.commit()

In [49]:
# Prepare a SQL Query
SQL_Query = executeSQL.execute('SELECT * FROM student_score')

In [50]:
# Fetch the Result From the SQLLITE Database
resultset = SQL_Query.fetchall()

In [51]:
resultset

[(10, 'Jack', 85.0, 92.0),
 (29, 'Tom', 73.0, 89.0),
 (65, 'Ram', 65.6, 77.0),
 (5, 'Steve', 55.0, 91.0)]

In [52]:
list(zip(*SQL_Query.description))[0]

('Id', 'NAME', 'Math', 'Science')

In [53]:
# Put Records Together in DataFrame
df_student_records = pd.DataFrame(resultset, columns=list(zip(*SQL_Query.description))[0])
df_student_records

   Id   NAME  Math  Science
0  10   Jack  85.0     92.0
1  29    Tom  73.0     89.0
2  65    Ram  65.6     77.0
3   5  Steve  55.0     91.0